tap "manaflow-ai/cmux"
tap "metalbear-co/mirrord"
tap "snyk/tap"
tap "txn2/tap"
brew "shellcheck"
brew "actionlint"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "bat-extras"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gitleaks"
brew "helm"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "mycli"
brew "python@3.12"
brew "ripgrep"
brew "rtk"
brew "stern"
brew "trivy"
brew "zoxide"
brew "zsh"
brew "metalbear-co/mirrord/mirrord"
brew "snyk/tap/snyk"
brew "txn2/tap/kubefwd"
cask "appcleaner"
cask "bruno"
cask "chatgpt"
cask "claude-code"
cask "cmux"
cask "codex"
cask "dbeaver-community"
cask "firefox"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "iterm2"
cask "lens"
cask "openvpn-connect"
cask "rancher"
cask "redis-insight"
cask "sourcetree"
cask "visual-studio-code"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bierner.lit-html"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "datadog.datadog-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "frigus02.vscode-sql-tagged-template-literals-syntax-only"
vscode "gabor.jsonl-gazelle"
vscode "github.vscode-github-actions"
vscode "jasonnutter.search-node-modules"
vscode "meganrogge.template-string-converter"
vscode "metalbear.mirrord"
vscode "ms-azuretools.vscode-containers"
vscode "nhoizey.gremlins"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pflannery.vscode-versionlens"
vscode "phil294.git-log--graph"
vscode "redhat.vscode-yaml"
vscode "runem.lit-plugin"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
cargo "cargo-audit"
cargo "just"
cargo "ptjira"
